{
  "nodes": [
    {
      "id": "center",
      "label": "GUS HALWANI",
      "hemisphere": "center",
      "x": 50,
      "y": 50,
      "connections": [
        "flow-state",
        "family",
        "new-node",
        "sparks",
        "heritage",
        "neuroscience",
        "neurace",
        "making",
        "code",
        "metal-guitar",
        "morning-ritual"
      ],
      "content": {
        "title": "Gus Halwani, PhD",
        "body": "I've spent my career following one signal through different frequencies: audio signals, neural signals, data signals, and now the ones that power the machines we're building together. This is my mental map. Follow the nodes to find the research, the craft, and the people who keep me grounded.",
        "image": null
      }
    },
    {
      "id": "ai-education",
      "label": "AI Education",
      "hemisphere": "left",
      "x": 30,
      "y": 35,
      "connections": [
        "neurace",
        "mit",
        "neuroscience"
      ],
      "content": {
        "title": "AI Education",
        "body": "I lead AI education strategy at a research and clinical medical center in Boston, focused on helping people across the organization fulfill our mission of care through AI and analytics. The work is about bridging: connecting awesome engineering teams building powerful tools with the people who use those tools to serve patients, researchers, and partners. Keeping the feedback loop between build-team and users healthy during unpredictable times. Compasses over maps. The machine handles the \"how\"; we reclaim the \"why.\"",
        "image": null
      }
    },
    {
      "id": "neurace",
      "label": "NeuRace",
      "hemisphere": "left",
      "x": 12,
      "y": 50,
      "connections": [
        "ai-education",
        "machines",
        "f1",
        "center",
        "gym",
        "code",
        "neuroscience"
      ],
      "content": {
        "title": "NeuRace",
        "body": "My company brought neurophysiology to motorsport. We worked with Pirelli World Challenge drivers and F1 development teams, using EEG and biometrics, along with a ton of vehicle-data, to optimize performance and decision-making under competition pressure. The questions that drove us:  What does \"the zone\" actually look like in the data—and can you train for it? Turns out elite performance isn't magic; it's measurable, and it's teachable. Those lessons followed me out of the paddock. The same principles that keep a driver locked in on lap 47 apply to building teams, shaping culture, and designing organizations that stay sharp when the stakes are high.",
        "image": null
      }
    },
    {
      "id": "neuroscience",
      "label": "Neuroscience",
      "hemisphere": "left",
      "x": 22,
      "y": 18,
      "connections": [
        "ai-education",
        "mit",
        "f1",
        "center",
        "neurace",
        "making",
        "code",
        "local-ai-lab",
        "multimodal-orchestration",
        "ai-roleplay"
      ],
      "content": {
        "title": "Neuroscience",
        "body": "Computational neuroscience, neuroimaging, EEG-based performance analysis, brain-computer interfaces for ALS patients—a thread that runs from my earliest lab work through everything I build today. In a way, the brain taught me systems thinking: how networks (whether cells, people, organizations, or countries) learn, adapt, and achieve more than any single node could alone. Those principles apply everywhere now, from architecting AI learning systems to building high-performance teams, to designing organizations where the whole exceeds the sum.",
        "image": null
      }
    },
    {
      "id": "mit",
      "label": "MIT",
      "hemisphere": "left",
      "x": 10,
      "y": 28,
      "connections": [
        "neuroscience",
        "ai-education",
        "f1",
        "code"
      ],
      "content": {
        "title": "MIT PhD Research",
        "body": "My doctoral work in the Harvard-MIT HST program studied how auditory-motor networks adapt—structurally and functionally—through long-term training and in states of disrupted function. I used diffusion-tensor imaging and fMRI to map the arcuate fasciculus and the regions it connects, and understand how singers optimize the pathways that connect hearing to action. The question that drove it: how do intense experiences rewire the brain? Still asking that today, just in different domains, and not always about carbon-based intelligence.",
        "image": null
      }
    },
    {
      "id": "flow-state",
      "label": "Flow State",
      "hemisphere": "center",
      "x": 38,
      "y": 62,
      "connections": [
        "center",
        "making",
        "machines",
        "code",
        "gym",
        "family",
        "new-node",
        "watch",
        "sparks",
        "metal-guitar",
        "morning-ritual"
      ],
      "content": {
        "title": "Flow State",
        "body": "The moment the inner narrator goes quiet and something else takes over. I find it at 7,500 RPM on a back road, deep in a codebase at 2 AM, under a barbell, and in unhurried mornings with my daughter. The same full-presence signal, different contexts. This is what connects everything I study and everything I do.",
        "image": null
      }
    },
    {
      "id": "family",
      "label": "Family",
      "hemisphere": "center",
      "x": 62,
      "y": 62,
      "connections": [
        "center",
        "heritage",
        "sparks",
        "flow-state",
        "gym",
        "morning-ritual",
        "metal-guitar",
        "new-node",
        "f1"
      ],
      "content": {
        "title": "Family",
        "body": "Maria and I call each other Squiggy—named after a bike path we rode when we first started dating, still finding new trails together. Cleo Mayyada is growing into someone with strong opinions and zero patience for shortcuts. Sunday meals take all day on purpose. Walks have no destination. Small rituals compound over years into something you can't replicate or rush. The work, the machines, the making—it all exists because this part is solid first.",
        "image": null
      }
    },
    {
      "id": "machines",
      "label": "Driving",
      "hemisphere": "right",
      "x": 70,
      "y": 35,
      "connections": [
        "flow-state",
        "f1",
        "watch",
        "neurace",
        "local-ai-lab",
        "ai-roleplay"
      ],
      "content": {
        "title": "Driving",
        "body": "Spirited back roads, track days chasing the perfect line, the meditation of managing a machine at its limits. Every corner is a feedback loop: entry speed, brake point, apex, throttle out. You optimize the line the same way you optimize anything—small adjustments, constant attention, knowing when to push and when to let the system breathe. It's problem-solving at 7,500 RPM. And somewhere in lap three, the thinking stops and the doing takes over.",
        "image": null
      }
    },
    {
      "id": "f1",
      "label": "F1",
      "hemisphere": "right",
      "x": 88,
      "y": 50,
      "connections": [
        "machines",
        "neurace",
        "local-ai-lab",
        "code",
        "ai-roleplay",
        "family",
        "mit",
        "neuroscience"
      ],
      "content": {
        "title": "Formula 1",
        "body": "Baz raised us on this—every qualifying session, every race, even the ones that started at 5 AM. Waking up early to watch cars go in circles sounds ridiculous until you realize you're studying peak engineering, strategy under pressure, and what happens when milliseconds separate victory from disaster. I still think too much about suspension geometry and tire compounds. The intersection of human performance and precision engineering. Margins are everything. Lessons everywhere.",
        "image": null
      }
    },
    {
      "id": "watch",
      "label": "Horology",
      "hemisphere": "right",
      "x": 78,
      "y": 18,
      "connections": [
        "machines",
        "flow-state",
        "making",
        "ai-roleplay",
        "sparks"
      ],
      "content": {
        "title": "Horology",
        "body": "Mechanical movements, case design, the obsessive craft of making something that keeps time without a battery. Yes, it sounds cheesy. Yes, I know a $20 quartz is more accurate. But there's something about centuries of accumulated knowledge sitting on your wrist, ticking away, that I can't explain rationally. Dream: own a watch repair shop someday. I *will* do it. Reach out if you want to partner on this. I'm serious.",
        "image": null
      }
    },
    {
      "id": "making",
      "label": "Making",
      "hemisphere": "left",
      "x": 20,
      "y": 72,
      "connections": [
        "flow-state",
        "kitchen",
        "djing",
        "metal-guitar",
        "ai-roleplay",
        "multimodal-orchestration",
        "morning-ritual",
        "watch",
        "sparks",
        "heritage",
        "center",
        "code",
        "neuroscience"
      ],
      "content": {
        "title": "Making",
        "body": "Music production taught me about flow states long before I studied them scientifically—and signal processing taught me how systems transform inputs into outputs, which turned out to be useful everywhere. Guitar, drums, whatever's in front of me—there's a moment where the technical thinking stops and something older takes over. These are the spaces where I'm not optimizing anything. Just making.",
        "image": null
      }
    },
    {
      "id": "djing",
      "label": "DJing",
      "hemisphere": "left",
      "x": 8,
      "y": 85,
      "connections": [
        "making",
        "sparks"
      ],
      "content": {
        "title": "DJing",
        "body": "House music. Reading the room, building energy, finding the groove that makes people move without thinking about it. Same skills as any flow activity: presence, responsiveness, knowing when to let go of the plan. The best sets are conversations you didn't plan to have.",
        "image": null
      }
    },
    {
      "id": "kitchen",
      "label": "Kitchen",
      "hemisphere": "left",
      "x": 30,
      "y": 88,
      "connections": [
        "making",
        "sparks"
      ],
      "content": {
        "title": "Sunday Kitchen Club",
        "body": "Sunday Kitchen Club. Slow cooking, Lebanese and Spanish influences, the kind of meal that takes all day and nobody's in a rush. Good food works like good music—patience, attention, letting the ingredients do what they want to do. One layer at a time.",
        "image": null
      }
    },
    {
      "id": "heritage",
      "label": "Heritage",
      "hemisphere": "right",
      "x": 75,
      "y": 75,
      "connections": [
        "family",
        "new-node",
        "sparks",
        "making",
        "morning-ritual",
        "center"
      ],
      "content": {
        "title": "Heritage",
        "body": "Grew up in Beirut, came to the US at 17. Learned early: read rooms fast, allocate scarce resources, stay calm when the stakes are real. Resourcefulness, pattern-matching, knowing when to push and when to disappear. Those instincts transferred—into how I build systems, navigate ambiguity, and stay effective when things get loud.",
        "image": null
      }
    },
    {
      "id": "sparks",
      "label": "Sparks",
      "hemisphere": "right",
      "x": 88,
      "y": 85,
      "connections": [
        "family",
        "center",
        "flow-state",
        "making",
        "kitchen",
        "djing",
        "new-node",
        "morning-ritual",
        "heritage",
        "watch",
        "gym"
      ],
      "content": {
        "title": "Sparks",
        "body": "Cleo Mayyada. Growing up between cultures, surrounded by music and machines and people who take things apart to understand them. She's already got opinions about all of it. The best reason to do anything well.",
        "image": null
      }
    },
    {
      "id": "code",
      "label": "Code",
      "hemisphere": "left",
      "x": 32,
      "y": 76,
      "connections": [
        "flow-state",
        "center",
        "local-ai-lab",
        "multimodal-orchestration",
        "ai-roleplay",
        "f1",
        "mit",
        "neurace",
        "making",
        "neuroscience"
      ],
      "content": {
        "title": "Code",
        "body": "Coding is changing fast. Agentic IDEs and CLIs now spawn entire software teams that actually ship pretty well. Once we solve the context problem, we're off to the races. The craft is shifting—we need to train engineers to think more like product designers, less like coders. The interesting work isn't syntax anymore; it's architecture, taste, and knowing what to build in the first place. I still love the act of building, but the leverage is different now.",
        "image": null
      }
    },
    {
      "id": "gym",
      "label": "Gym",
      "hemisphere": "right",
      "x": 58,
      "y": 82,
      "connections": [
        "flow-state",
        "family",
        "center",
        "new-node",
        "neurace",
        "morning-ritual",
        "sparks"
      ],
      "content": {
        "title": "Gym",
        "body": "Training as daily practice. Strength, endurance, the discipline of showing up when you don't feel like it. The simplest feedback loop: effort in, clarity out. Everything else runs better when this part is consistent.",
        "image": null
      }
    },
    {
      "id": "local-ai-lab",
      "label": "Local AI Lab",
      "hemisphere": "left",
      "x": 24,
      "y": 58,
      "connections": [
        "ai-education",
        "code",
        "center",
        "multimodal-orchestration",
        "machines",
        "f1",
        "neuroscience"
      ],
      "content": {
        "title": "Local AI Lab",
        "body": "GPUs humming in the basement, models running locally, no cloud required. I like building AI systems I can touch—fast, private, hands-on. This is the sandbox where I test what's possible before it goes anywhere else. Half the fun is the infrastructure itself.",
        "image": null
      }
    },
    {
      "id": "multimodal-orchestration",
      "label": "Multimodal",
      "hemisphere": "left",
      "x": 18,
      "y": 64,
      "connections": [
        "local-ai-lab",
        "making",
        "code",
        "ai-education",
        "ai-roleplay",
        "neuroscience"
      ],
      "content": {
        "title": "Multimodal Orchestration",
        "body": "Chaining models into creative pipelines—text to image to audio to video, often starting from messy conversational brainstorms. The interesting part isn't any single model; it's the orchestration. How do you move from a half-baked idea to finished media without losing the spark? That's the design problem I keep coming back to.",
        "image": null
      }
    },
    {
      "id": "metal-guitar",
      "label": "Guitar",
      "hemisphere": "left",
      "x": 12,
      "y": 78,
      "connections": [
        "making",
        "family",
        "center",
        "flow-state"
      ],
      "content": {
        "title": "Guitar",
        "body": "Funk, soul, blues, rock, Lebanese scales I grew up hearing—it all bleeds together when I pick up a guitar. Neighborhood jams with another dad on the block where the amps get loud and the riffs get heavy. But also quieter moments, finding where the traditions overlap. Playing is how I think when words don't work.",
        "image": null
      }
    },
    {
      "id": "ai-roleplay",
      "label": "Game Design",
      "hemisphere": "left",
      "x": 28,
      "y": 84,
      "connections": [
        "making",
        "code",
        "multimodal-orchestration",
        "machines",
        "watch",
        "f1",
        "neuroscience"
      ],
      "content": {
        "title": "Game Design",
        "body": "Using emerging tech to build immersive experiences—persona-based roleplays, rich multimodal interaction, worlds that respond to you. Some of this is serious: enterprise training, simulations that teach through doing. Some of it is just for fun: anime aesthetics, cyberpunk vibes, seeing how far the tools can stretch. The line between play and impact keeps getting blurrier, and I like it there.",
        "image": null
      }
    },
    {
      "id": "morning-ritual",
      "label": "Morning Ritual",
      "hemisphere": "center",
      "x": 48,
      "y": 84,
      "connections": [
        "family",
        "sparks",
        "making",
        "new-node",
        "heritage",
        "center",
        "flow-state",
        "gym"
      ],
      "content": {
        "title": "Morning Ritual",
        "body": "Swim, weights, and steam room on gym days. Breakfast with Maria and Cleo Mayyada on the others—slow mornings, good coffee, connection before the noise starts. Either way, it's the anchor. The rest of the day runs differently when this part happens.",
        "image": null
      }
    },
    {
      "id": "new-node",
      "label": "Swimming",
      "hemisphere": "right",
      "x": 80,
      "y": 59,
      "connections": [
        "center",
        "family",
        "flow-state",
        "heritage",
        "gym",
        "morning-ritual",
        "sparks"
      ],
      "content": {
        "title": "New Node",
        "body": "",
        "image": null
      }
    }
  ]
}